app/views/messages/create.json.jbuilder

json.content    @message.content
json.time    @message.created_at.strftime("%Y-%m-%d %H:%M")
---
INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('', 'IMG_3222.jpg', 2, 1, '2019-03-29 06:43:09', '2019-03-29 06:43:09')