app/views/groups/_form.html.haml

SELECT `users`.* FROM `users`
---
    .chat-group-form__field--right
      = f.collection_check_boxes :user_ids, User.all, :id, :name