app/controllers/groups_controller.rb

  def create
    @group = Group.new(group_params)
    if @group.save
---
INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('test', '2019-03-23 10:17:18', '2019-03-23 10:17:18')

  def set_group
    @group = Group.find(params[:id])
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1