app/controllers/messages_controller.rb

  def index
    @message = Message.new
    @messages = @group.messages.includes(:user)
    respond_to do |format|
        format.html
        format.json { @new_messages = @messages.where('id > ?', params[:message][:id])}
---
SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 16 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 18
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1

  def create
    @message = @group.messages.new(message_params)
    @message.user = current_user
    if @message.save
      respond_to do |format|
        format.html
        format.json
      end
    else
      @messages = @group.messages.includes(:user)
---
INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('', 'IMG_2861.jpeg', 1, 1, '2019-03-26 06:40:40', '2019-03-26 06:40:40')
SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 1 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 2

  def set_group
    @group = Group.find(params[:group_id])
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 16 LIMIT 1